{
  "url": "https://indianculture.gov.in/food-and-culture",
  "timestamp": "2025-05-18T13:46:43.082197",
  "content": "Food and Culture | INDIAN CULTURE Sorry, you need to enable JavaScript to visit this website. Skip to main content Government of India Skip to main content - A A + A A A Select your language English हिंदी Union Catalogue Indian National Bibliography Videos Images Reports & Proceedings Other Collections Stories Retrieved Artefacts of India Festivals of India Flagship Events Timeless Trends Digital District Repository North-East Archive Ajanta Caves Textiles and Fabrics of India Forts of India Historic Cities of India Audios Snippets Intangible Cultural Heritage Paintings UNESCO Musical Instruments of India Research Papers Photo Essays Food & Culture Rare Books E-Books Manuscripts Museum Collections Archives Photo Archives Gazettes and Gazetteers Union Catalogue Indian National Bibliography Videos Images Reports & Proceedings Other Collections Stories Retrieved Artefacts of India Festivals of India Flagship Events Timeless Trends Digital District Repository North-East Archive Ajanta Caves Textiles and Fabrics of India Forts of India Historic Cities of India Audios Snippets Intangible Cultural Heritage Paintings UNESCO Musical Instruments of India Research Papers Photo Essays Food & Culture Rare Books E-Books Manuscripts Museum Collections Archives Photo Archives Gazettes and Gazetteers Union Catalogue Indian National Bibliography Videos Images Reports & Proceedings Other Collections Stories 1 2 3 4 5 Evolution of Indian Gastronomy Cuisines of India Timeless Recipes Spices & Herbs Rare Texts on Cuisine Food & Festivals Food: Images of Diversity Partners IIT Bombay Indian Institute of Technology Bombay Recognizing the ongoing need to position itself for the digital future, Indian Culture is an initiative by the Ministry of Culture. A platform that hosts data of cultural relevance from various repositories and institutions all over India. The Indian Culture Portal is a part of the National Virtual Library of India project, funded by the Ministry of Culture, Government of India. The portal has been created and developed by the Indian Institute of Technology, Bombay. Data has been provided by organisations of the Ministry of Culture. Email Id : indian-culture@gov.in",
  "images": [],
  "videos": []
}